app/controllers/posts_controller.rb

  def index
    @authors = Author.all
    if !params[:author].blank?
      @posts = Post.by_author(params[:author])
    elsif !params[:date].blank?
      @posts = Post.from_today if params[:date] == "Today"
      @posts = Post.old_news
    else
      @posts = Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')